Revit 2027 API
BreakCornerCondition Enumeration
 Condition on which the corner post is inserted.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BreakCornerCondition
Public Enumeration BreakCornerCondition
public enum class BreakCornerCondition
type BreakCornerCondition
Members
Member name | Value | Description
AnglesGreaterThan | 1 |  Corner posts are inserted only when the angle between neighboring path segments is greater than the defined.
EachSegmentEnd | 0 |  Corner posts are inserted at each segment end.
Never | 2 |  Corner posts are not inserted in railings.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace